# SQL Joins: TMDb Database

## The TMDb Database

In this challenge you will be exploring the [The Movie Database](https://www.themoviedb.org/) - an online movie and TV show database, which houses some of the most popular movies and TV shows at your finger tips. The TMDb database supports 39 official languages used in over 180 countries daily and dates all the way back to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship diagram(ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ER diagram, the TMDb database consists of `12 tables` containing information about movies, cast, genre and so much more.  

Let's get started!

## Loading the database

To begin and start making use of SQL queries you need to prepare your SQL environment you can do this by loading in the magic command `%load_ext sql`, next you can go ahead and load in your database. To do this you will need to ensure you have downloaded the `TMDB.db`sqlite file from Athena and have stored it in a known location. Now that you have all the prerequisites you can go ahead and load it into the notebook.

In [35]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [36]:
%%sql 

sqlite:///C:/Users/Kabelo/Desktop/EDSA/Fundimentals/SQL/Tests/Join_Statements/TMDB.db

## Questions on SQL Join Statements 

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided for the multiple choice questions on Athena.

**Question 1**

What is the primary key for the table “movies”?

**Options:** 
 - title
 - movie_key
 - film_id
 - movie_id

**Solution**

movie_id

**Question 2**

How many foreign keys does the “LanguageMap” table have?

**Options:**

 - 0
 - 2
 - 3
 - 1

**Solution**

2

**Question 3**

How many movies in the database were produced by Pixar Animation Studios?

**Options:**
 - 16
 - 14
 - 18
 - 20

**Solution**

In [37]:
%%sql

SELECT COUNT(m.movie_id) AS "Pixar Animation Studios movies"
FROM movies AS m
INNER JOIN productioncompanymap AS pcm
ON m.movie_id = pcm.movie_id
INNER JOIN productioncompanies AS pc
ON pcm.production_company_id = pc.production_company_id
WHERE pc.production_company_name = "Pixar Animation Studios"

 * sqlite:///C:/Users/Kabelo/Desktop/EDSA/Fundimentals/SQL/Tests/Join_Statements/TMDB.db
Done.

[(16,)]

**Question 4**

What is the most popular action movie that has some German in it? (Hint: The German word for German is Deutsch)

**Options:**
 - The Bourne Identity
 - Mission: Impossible - Rogue Nation
 - Captain America: Civil War
 - Quantum of Solace

**Solution**

In [39]:
%%sql

SELECT m.title, m.popularity
FROM movies AS m
INNER JOIN genremap AS gm
ON m.movie_id = gm.movie_id
INNER JOIN genres AS g
ON gm.genre_id = g.genre_id

INNER JOIN languagemap AS lm
ON m.movie_id = lm.movie_id
INNER JOIN languages AS l
ON lm.iso_639_1 = l.iso_639_1
WHERE l.language_name = "Deutsch" AND g.genre_name = "Action"
order by m.popularity desc
LIMIT 5;

 * sqlite:///C:/Users/Kabelo/Desktop/EDSA/Fundimentals/SQL/Tests/Join_Statements/TMDB.db
Done.

[('Captain America: Civil War', 198.372395),
 ('Mission: Impossible - Rogue Nation', 114.522237),
 ('The Fifth Element', 109.528572),
 ('Quantum of Solace', 107.928811),
 ('Spectre', 107.376788)]

**Question 5**

In how many movies did Tom Cruise portray the character Ethan Hunt? (Hint: Characters are listed in the Casts table.)

**Options:**
 - 4
 - 3
 - 6
 - 5

**Solution**

In [40]:
%%sql

SELECT COUNT(m.title) AS "Movie Title count"
FROM movies AS m
INNER JOIN casts AS c
ON m.movie_id = c.movie_id
INNER JOIN actors AS a
ON c.actor_id = a.actor_id
WHERE actor_name = "Tom Cruise" AND characters = "Ethan Hunt"

 * sqlite:///C:/Users/Kabelo/Desktop/EDSA/Fundimentals/SQL/Tests/Join_Statements/TMDB.db
Done.

[(5,)]

**Question 6**

How many times was the actress Cate Blanchett nominated for an Oscar?
 
 **Options:**
 - 7
 - 4
 - 5
 - 2

**Solution**

In [41]:
%%sql

SELECT o.name, count(o.name) AS "Number of Nominations"
FROM movies AS m
INNER JOIN casts AS c
ON m.movie_id=c.movie_id
INNER JOIN actors AS a
on a.actor_id=c.actor_id
INNER JOIN oscars AS o
ON o.film=m.title
WHERE a.actor_name = "Cate Blanchett" AND o.name ="Cate Blanchett";

 * sqlite:///C:/Users/Kabelo/Desktop/EDSA/Fundimentals/SQL/Tests/Join_Statements/TMDB.db
Done.

[('Cate Blanchett', 5)]

**Question 7** 

How many movies contain at least one of the languages, Afrikaans or Zulu?

**Options:**
 - 10
 - 8
 - 12
 - 15

**Solution**

In [42]:
%%sql

SELECT COUNT(m.movie_id) AS "Movies with Afrikaans or Zulu"
FROM movies AS m
INNER JOIN languagemap AS lm
ON m.movie_id = lm.movie_id
INNER JOIN languages AS l
ON lm.iso_639_1 = l.iso_639_1
WHERE l.language_name = "Afrikaans" OR l.language_name = "Zulu"

 * sqlite:///C:/Users/Kabelo/Desktop/EDSA/Fundimentals/SQL/Tests/Join_Statements/TMDB.db
Done.

[(7,)]

**Question 8**

In which country was the movie “Star Wars” produced?  

**Options:**
 - Canada
 - United Kingdom
 - France
 - United States of America

**Solution**

In [43]:
%%sql

SELECT m.title AS "Movie Title", pc.production_country_name AS "Production Country Name"
FROM movies AS m
INNER JOIN productioncountrymap AS pcm
ON m.movie_id = pcm.movie_id
INNER JOIN productioncountries AS pc
ON pcm.iso_3166_1 = pc.iso_3166_1
WHERE m.title = "Star Wars"

 * sqlite:///C:/Users/Kabelo/Desktop/EDSA/Fundimentals/SQL/Tests/Join_Statements/TMDB.db
Done.

[('Star Wars', 'United States of America')]